ProgressReport.org
#+OPTIONS: toc:nil author:nil date:nil
#+LATEX_HEADER: \usepackage[margin=1in]{geometry}

#+TITLE: Progress Report
Sam Messina

Ganesh Koripali

Mohammed Abdulkadir

| Assigned              | Todo (0%) | Doing (0% - 100%)                  | Done (100%)            |
|-----------------------+-----------+------------------------------------+------------------------|
| Sam, Ganesh, Mohammed |           |                                    | BNF                    |
| Sam, Ganesh, Mohammed |           |                                    | Denotational Semantics |
| Sam                   |           | Create Parser (90% done)           |                        |
| Mohommed, Sam         |           | Create Lexical Analyzer (20% done) |                        |
| Ganesh                |           | Create Pseudo-compiler)            |                        |

* Todo specifics
** Create BNF
   Come up with syntax for our language and write BNF/EBNF to specify it. Language should support all queue functions, including:
- [X] line
- [X] expression
- [X] Add
- [X] Remove
- [X] Peek
- [X] Get Length
- [X] Is Empty
- [X] Not Empty
- [X] view
- [X] If
- [X] element
** Create Denotational Semantics
   Write a set of denotaional semantics detailing semantics of queue creation and function calls
** Create Parser
   Create a parser that will run through source code and return a list of all valid tokens found. Parser will:
- [X] Take in the source code of the program
- [ ] Extracts Tokens
- [X] Return an array of tokens for the program
** Create Lexical Analyzer 
   Create a lexical analyzer that:
- [X] Takes its input from our parser
- [ ] Checks the syntax against our BNF
- [ ] Checks semantics against denotational semantic rules
- [ ] Evaluates action to be taken
- [ ] Passes instructions to compiler to preform actions
** Create Pseudo Compiler
   Runs commands as specified by the lexical analyzer. This includes:
- [X] Maintain state of program while lexical analyzer is working
- [ ] Take instructions from analyzer to adjust state and the queue
- [X] Preform instructions using Java
- [X] Run program

